CSI API ETABS v1

# cAnalyze Interface

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    public interface cAnalyze

    Public Interface cAnalyze

    Dim instance As cAnalyze

    public interface class cAnalyze

    type cAnalyze =  interface end

The cAnalyze type exposes the following members.

Methods

| Name| Description
---|---|---
|
CreateAnalysisModel|  Creates the
analysis model. If the analysis model is already created and current, nothing
is done.
| [DeleteResults](78802e8a-ceff-
bb3b-4f27-a805ef90d148.htm)|  Deletes results for load cases.
|
GetActiveDOF|  Retrieves the model
global degrees of freedom.
|
GetCaseStatus|  Retrieves the
status for all load cases.
|
GetDesignResponseOption|
Retrieves the design and response recovery options.
|
GetRunCaseFlag|  Retrieves the run
flags for all analysis cases.
|
GetSolverOption|  DEPRECATED.
Please see GetSolverOption_2(Int32, Int32, Int32,
String) or
[GetSolverOption_3(Int32, Int32, Int32, Int32, Int32, String)](be3d8ebc-
bc94-8008-4c90-24bc79442266.htm)
|
GetSolverOption_1|  DEPRECATED.
Please see GetSolverOption_2(Int32, Int32, Int32,
String) or
[GetSolverOption_3(Int32, Int32, Int32, Int32, Int32, String)](be3d8ebc-
bc94-8008-4c90-24bc79442266.htm)
|
GetSolverOption_2|  Retrieves the
model solver options.
| [GetSolverOption_3](be3d8ebc-
bc94-8008-4c90-24bc79442266.htm)|  Retrieves the model solver options.
|
MergeAnalysisResults|  Merges
analysis results from a given model.
|
ModifyUndeformedGeometry|
Modifies the undeformed geometry based on displacements obtained from a
specified load case
|
ModifyUndeformedGeometryModeShape|
Modifies the undeformed geometry based on the shape of a specified mode
|
RunAnalysis|  Runs the analysis.
|
SetActiveDOF|  Sets the model
global degrees of freedom.
|
SetDesignResponseOption|  Sets the
design and response recovery options.
|
SetRunCaseFlag|  Sets the run flag
for load cases.
|
SetSolverOption|  DEPRECATED.
Please see SetSolverOption_2(Int32, Int32, Int32,
String) or
SetSolverOption_3(Int32, Int32, Int32, Int32, Int32,
String)
|
SetSolverOption_1|  DEPRECATED.
Please see SetSolverOption_2(Int32, Int32, Int32,
String) or
SetSolverOption_3(Int32, Int32, Int32, Int32, Int32,
String)
|
SetSolverOption_2|  Sets the model
solver options.
|
SetSolverOption_3|  Sets the model
solver options.
Top

See Also

#### Reference

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com